# 01 Import libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02 Import data and set up paths

In [2]:
df = pd.read_pickle(r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis\02 Data\Prepared Data\orders_complete.pkl')

In [3]:
path = r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis'

In [4]:
path

'C:\\Users\\christina.savva\\Documents\\CF Achievement 4 - Instacart Basket Analysis'

In [5]:
df_orders_products_combined = df

In [6]:
df_orders_products_combined.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [7]:
df_orders_products_combined_new = df_orders_products_combined.drop(columns = ['_merge'])

In [8]:
df_orders_products_combined_new.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [9]:
df = pd.read_csv(r'C:\Users\christina.savva\Documents\CF Achievement 4 - Instacart Basket Analysis\02 Data\Prepared Data\products_checked.csv', index_col = False)

In [10]:
df_prods = df

In [11]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [12]:
df_prods_new = df_prods.drop(columns = ['Unnamed: 0'])

In [13]:
df_prods_new.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

# 4.6.4 Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

In [14]:
df_orders_products_combined_new.shape  #same size as when merged in 4.6 Reading (32,434,489 rows)

(32434489, 9)

In [15]:
df_prods_new.shape

(49672, 5)

# 4.6.5 Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [16]:
#  I want to merge both dataframes on product_id, which links both as unique identifier / key

In [17]:
df_orders_products_merged = df_orders_products_combined_new.merge(df_prods_new, on = ['product_id'], how = 'inner', indicator = True)

In [18]:
df_orders_products_merged.shape

(32404859, 14)

In [ ]:
#  lost 29630 rows

In [19]:
df_orders_products_merged.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [20]:
df_orders_products_merged['_merge'].value_counts()  #  full match

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [21]:
df_orders_products_merged.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_from_pkl_inner_join.csv'))